Repository: Centaur/lua-nginx-module
Catalog: omegat/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: == ngx.req.read_body == '''syntax:''' ''ngx.req.read_body()''
zh_cn: == ngx.req.read_body == '''语法:''' ''ngx.req.read_body()''

source: == ngx.req.set_body_data == '''syntax:''' ''ngx.req.set_body_data(data)''
zh_cn: == ngx.req.set_body_data == '''语法:''' ''ngx.req.set_body_data(data)''

source: == ngx.req.set_body_file == '''syntax:''' ''ngx.req.set_body_file(file_name, auto_clean?)''
zh_cn: == ngx.req.set_body_file == '''语法:''' ''ngx.req.set_body_file(file_name, auto_clean?)''

source: == ngx.req.set_header == '''syntax:''' ''ngx.req.set_header(header_name, header_value)''
zh_cn: == ngx.req.set_header == '''语法:''' ''ngx.req.set_header(header_name, header_value)''

source: == ngx.req.set_method == '''syntax:''' ''ngx.req.set_method(method_id)''
zh_cn: == ngx.req.set_method == '''语法:''' ''ngx.req.set_method(method_id)''

source: == ngx.req.set_uri == '''syntax:''' ''ngx.req.set_uri(uri, jump?)''
zh_cn: == ngx.req.set_uri == '''语法:''' ''ngx.req.set_uri(uri, jump?)''

source: == ngx.req.set_uri_args == '''syntax:''' ''ngx.req.set_uri_args(args)''
zh_cn: == ngx.req.set_uri_args == '''语法:''' ''ngx.req.set_uri_args(args)''

source: == ngx.req.socket == '''syntax:''' ''tcpsock, err = ngx.req.socket()''
zh_cn: == ngx.req.socket == '''语法:''' ''tcpsock, err = ngx.req.socket()''

source: == ngx.req.start_time == '''syntax:''' ''secs = ngx.req.start_time()''
zh_cn: == ngx.req.start_time == '''语法:''' ''secs = ngx.req.start_time()''

source: == ngx.say == '''syntax:''' ''ok, err = ngx.say(...)''
zh_cn: == ngx.say == '''语法:''' ''ok, err = ngx.say(...)''

source: == ngx.send_headers == '''syntax:''' ''ok, err = ngx.send_headers()''
zh_cn: == ngx.send_headers == '''语法:''' ''ok, err = ngx.send_headers()''

source: == ngx.sha1_bin == '''syntax:''' ''digest = ngx.sha1_bin(str)''
zh_cn: == ngx.sha1_bin == '''语法:''' ''digest = ngx.sha1_bin(str)''

source: == ngx.shared.DICT == '''syntax:''' ''dict = ngx.shared.DICT''
zh_cn: == ngx.shared.DICT == '''语法:''' ''dict = ngx.shared.DICT''

source: == ngx.shared.DICT.add == '''syntax:''' ''success, err, forcible = ngx.shared.DICT:add(key, value, exptime?, flags?)''
zh_cn: == ngx.shared.DICT.add == '''语法:''' ''success, err, forcible = ngx.shared.DICT:add(key, value, exptime?, flags?)''

source: == ngx.shared.DICT.delete == '''syntax:''' ''ngx.shared.DICT:delete(key)''
zh_cn: == ngx.shared.DICT.delete == '''语法:''' ''ngx.shared.DICT:delete(key)''

source: == ngx.shared.DICT.flush_all == '''syntax:''' ''ngx.shared.DICT:flush_all()''
zh_cn: == ngx.shared.DICT.flush_all == '''语法:''' ''ngx.shared.DICT:flush_all()''

source: == ngx.shared.DICT.flush_expired == '''syntax:''' ''flushed = ngx.shared.DICT:flush_expired(max_count?)''
zh_cn: == ngx.shared.DICT.flush_expired == '''语法:''' ''flushed = ngx.shared.DICT:flush_expired(max_count?)''

source: == ngx.shared.DICT.get == '''syntax:''' ''value, flags = ngx.shared.DICT:get(key)''
zh_cn: == ngx.shared.DICT.get == '''语法:''' ''value, flags = ngx.shared.DICT:get(key)''

source: == ngx.shared.DICT.get_keys == '''syntax:''' ''keys = ngx.shared.DICT:get_keys(max_count?)''
zh_cn: == ngx.shared.DICT.get_keys == '''语法:''' ''keys = ngx.shared.DICT:get_keys(max_count?)''

source: == ngx.shared.DICT.get_stale == '''syntax:''' ''value, flags, stale = ngx.shared.DICT:get_stale(key)''
zh_cn: == ngx.shared.DICT.get_stale == '''语法:''' ''value, flags, stale = ngx.shared.DICT:get_stale(key)''

source: == ngx.shared.DICT.incr == '''syntax:''' ''newval, err = ngx.shared.DICT:incr(key, value)''
zh_cn: == ngx.shared.DICT.incr == '''语法:''' ''newval, err = ngx.shared.DICT:incr(key, value)''

source: == ngx.shared.DICT.replace == '''syntax:''' ''success, err, forcible = ngx.shared.DICT:replace(key, value, exptime?, flags?)''
zh_cn: == ngx.shared.DICT.replace == '''语法:''' ''success, err, forcible = ngx.shared.DICT:replace(key, value, exptime?, flags?)''

source: == ngx.shared.DICT.safe_add == '''syntax:''' ''ok, err = ngx.shared.DICT:safe_add(key, value, exptime?, flags?)''
zh_cn: == ngx.shared.DICT.safe_add == '''语法:''' ''ok, err = ngx.shared.DICT:safe_add(key, value, exptime?, flags?)''

source: == ngx.shared.DICT.safe_set == '''syntax:''' ''ok, err = ngx.shared.DICT:safe_set(key, value, exptime?, flags?)''
zh_cn: == ngx.shared.DICT.safe_set == '''语法:''' ''ok, err = ngx.shared.DICT:safe_set(key, value, exptime?, flags?)''

source: == ngx.shared.DICT.set == '''syntax:''' ''success, err, forcible = ngx.shared.DICT:set(key, value, exptime?, flags?)''
zh_cn: == ngx.shared.DICT.set == '''语法:''' ''success, err, forcible = ngx.shared.DICT:set(key, value, exptime?, flags?)''

source: == ngx.sleep == '''syntax:''' ''ngx.sleep(seconds)''
zh_cn: == ngx.sleep == '''语法:''' ''ngx.sleep(seconds)''

source: == ngx.socket.connect == '''syntax:''' ''tcpsock, err = ngx.socket.connect(host, port)''
zh_cn: == ngx.socket.connect == '''语法:''' ''tcpsock, err = ngx.socket.connect(host, port)''

source: == ngx.socket.tcp == '''syntax:''' ''tcpsock = ngx.socket.tcp()''
zh_cn: == ngx.socket.tcp == '''语法:''' ''tcpsock = ngx.socket.tcp()''

source: == ngx.socket.udp == '''syntax:''' ''udpsock = ngx.socket.udp()''
zh_cn: == ngx.socket.udp == '''语法:''' ''udpsock = ngx.socket.udp()''

source: == ngx.status == '''context:''' ''set_by_lua*, rewrite_by_lua*, access_by_lua*, content_by_lua*, header_filter_by_lua*, body_filter_by_lua, log_by_lua*''
zh_cn: == ngx.status == '''可包含于:''' ''set_by_lua*, rewrite_by_lua*, access_by_lua*, content_by_lua*, header_filter_by_lua*, body_filter_by_lua, log_by_lua*''

source: == ngx.thread.spawn == '''syntax:''' ''co = ngx.thread.spawn(func, arg1, arg2, ...)''
zh_cn: == ngx.thread.spawn == '''语法:''' ''co = ngx.thread.spawn(func, arg1, arg2, ...)''

source: == ngx.thread.wait == '''syntax:''' ''ok, res1, res2, ... = ngx.thread.wait(thread1, thread2, ...)''
zh_cn: == ngx.thread.wait == '''语法:''' ''ok, res1, res2, ... = ngx.thread.wait(thread1, thread2, ...)''

source: == ngx.time == '''syntax:''' ''secs = ngx.time()''
zh_cn: == ngx.time == '''语法:''' ''secs = ngx.time()''

source: == ngx.timer.at == '''syntax:''' ''ok, err = ngx.timer.at(delay, callback, user_arg1, user_arg2, ...)''
zh_cn: == ngx.timer.at == '''语法:''' ''ok, err = ngx.timer.at(delay, callback, user_arg1, user_arg2, ...)''

source: == ngx.today == '''syntax:''' ''str = ngx.today()''
zh_cn: == ngx.today == '''语法:''' ''str = ngx.today()''

source: == ngx.unescape_uri == '''syntax:''' ''newstr = ngx.unescape_uri(str)''
zh_cn: == ngx.unescape_uri == '''语法:''' ''newstr = ngx.unescape_uri(str)''

source: == ngx.update_time == '''syntax:''' ''ngx.update_time()''
zh_cn: == ngx.update_time == '''语法:''' ''ngx.update_time()''

source: == ngx.utctime == '''syntax:''' ''str = ngx.utctime()''
zh_cn: == ngx.utctime == '''语法:''' ''str = ngx.utctime()''

source: == ngx.var.VARIABLE == '''syntax:''' ''ngx.var.VAR_NAME''
zh_cn: == ngx.var.VARIABLE == '''语法:''' ''ngx.var.VAR_NAME''

source: == print == '''syntax:''' ''print(...)''
zh_cn: == print == '''语法:''' ''print(...)''

source: == set_by_lua_file == '''syntax:''' ''set_by_lua_file $res <path-to-lua-script-file> [$arg1 $arg2 ...]''
zh_cn: == set_by_lua_file == '''语法:''' ''set_by_lua_file $res <path-to-lua-script-file> [$arg1 $arg2 ...]''

source: == tcpsock:close == '''syntax:''' ''ok, err = tcpsock:close()''
zh_cn: == tcpsock:close == '''语法:''' ''ok, err = tcpsock:close()''

source: == tcpsock:connect == '''syntax:''' ''ok, err = tcpsock:connect(host, port, options_table?)''
zh_cn: == tcpsock:connect == '''语法:''' ''ok, err = tcpsock:connect(host, port, options_table?)''

source: == tcpsock:getreusedtimes == '''syntax:''' ''count, err = tcpsock:getreusedtimes()''
zh_cn: == tcpsock:getreusedtimes == '''语法:''' ''count, err = tcpsock:getreusedtimes()''

source: == tcpsock:receive == '''syntax:''' ''data, err, partial = tcpsock:receive(size)''
zh_cn: == tcpsock:receive == '''语法:''' ''data, err, partial = tcpsock:receive(size)''

source: == tcpsock:receiveuntil == '''syntax:''' ''iterator = tcpsock:receiveuntil(pattern, options?)''
zh_cn: == tcpsock:receiveuntil == '''语法:''' ''iterator = tcpsock:receiveuntil(pattern, options?)''

source: == tcpsock:send == '''syntax:''' ''bytes, err = tcpsock:send(data)''
zh_cn: == tcpsock:send == '''语法:''' ''bytes, err = tcpsock:send(data)''

source: == tcpsock:setkeepalive == '''syntax:''' ''ok, err = tcpsock:setkeepalive(timeout?, size?)''
zh_cn: == tcpsock:setkeepalive == '''语法:''' ''ok, err = tcpsock:setkeepalive(timeout?, size?)''

source: == tcpsock:setoption == '''syntax:''' ''tcpsock:setoption(option, value?)''
zh_cn: == tcpsock:setoption == '''语法:''' ''tcpsock:setoption(option, value?)''

source: == tcpsock:settimeout == '''syntax:''' ''tcpsock:settimeout(time)''
zh_cn: == tcpsock:settimeout == '''语法:''' ''tcpsock:settimeout(time)''

source: == udpsock:close == '''syntax:''' ''ok, err = udpsock:close()''
zh_cn: == udpsock:close == '''语法:''' ''ok, err = udpsock:close()''

source: == udpsock:receive == '''syntax:''' ''data, err = udpsock:receive(size?)''
zh_cn: == udpsock:receive == '''语法:''' ''data, err = udpsock:receive(size?)''

source: == udpsock:send == '''syntax:''' ''ok, err = udpsock:send(data)''
zh_cn: == udpsock:send == '''语法:''' ''ok, err = udpsock:send(data)''

source: == udpsock:setpeername == '''syntax:''' ''ok, err = udpsock:setpeername(host, port)''
zh_cn: == udpsock:setpeername == '''语法:''' ''ok, err = udpsock:setpeername(host, port)''

source: == udpsock:settimeout == '''syntax:''' ''udpsock:settimeout(time)''
zh_cn: == udpsock:settimeout == '''语法:''' ''udpsock:settimeout(time)''

source: A "light thread" will keep running exclusively on the CPU until # a (nonblocking) I/O operation cannot be completed in a single run, # it calls [[#coroutine.yield|coroutine.yield]] to actively give up execution, or # it is aborted by a Lua error or an invocation of [[#ngx.exit|ngx.exit]], [[#ngx.exec|ngx.exec]], [[#ngx.redirect|ngx.redirect]], or [[#ngx.req.set_uri|ngx.req.set_uri(uri, true)]].
zh_cn: 一个 "轻量线程" 将独占cpu运行，直到 # 无法在单独一次运行中完成一个 (非阻塞的) I/O 操作, # 它调用 [[#coroutine.yield|coroutine.yield]] 主动放弃执行, 或 # 由于Lua错误或调用 [[#ngx.exit|ngx.exit]], [[#ngx.exec|ngx.exec]], [[#ngx.redirect|ngx.redirect]], 或 [[#ngx.req.set_uri|ngx.req.set_uri(uri, true)]]而中断.

source: A lot of the Lua APIs for Nginx are enabled in the context of the timer callbacks, like stream/datagram cosockets ([[#ngx.socket.tcp|ngx.socket.tcp]] and [[#ngx.socket.udp|ngx.socket.udp]]), shared memory dictionaries ([[#ngx.shared.DICT|ngx.shared.DICT]]), user coroutines ([[#coroutine.create|coroutine.*]]), user "light threads" ([[#ngx.thread.spawn|ngx.thread.*]]), [[#ngx.exit|ngx.exit]], [[#ngx.now|ngx.now]]/[[#ngx.time|ngx.time]], [[#ngx.md5|ngx.md5]]/[[#ngx.sha1_bin|ngx.sha1_bin]], are all allowed.
zh_cn: 在定时器回调函数中可以使用很多供Nginx使用的Lua API, 如流/数据报 cosocket ([[#ngx.socket.tcp|ngx.socket.tcp]] 和 [[#ngx.socket.udp|ngx.socket.udp]]), 共享内存字典 ([[#ngx.shared.DICT|ngx.shared.DICT]]), 用户coroutine ([[#coroutine.create|coroutine.*]]), 用户 "轻量线程" ([[#ngx.thread.spawn|ngx.thread.*]]), [[#ngx.exit|ngx.exit]], [[#ngx.now|ngx.now]]/[[#ngx.time|ngx.time]], [[#ngx.md5|ngx.md5]]/[[#ngx.sha1_bin|ngx.sha1_bin]], 都可以使用.

source: A more sophisticated example involving regex substitutions is as follows
zh_cn: 下面是一个更复杂的包含正则替换的例子

source: A notable exception here is that you can abort pending subrequests by calling [[#ngx.exit|ngx.exit]] with and only with the status code <code>ngx.ERROR</code> (-1), <code>408</code>, <code>444</code>, or <code>499</code>.
zh_cn: 这里有个例外是你可以使用状态码<code>ngx.ERROR</code> (-1)，<code>408</code>, <code>444</code>, or <code>499</code>来调用[[#ngx.exitngx.exit]]从而中断某个子请求.

source: Accessing <code>/lua</code> will yield the output
zh_cn: 访问 <code>/lua</code> 的结果

source: According to the current implementation, each "running timer" will take one (fake) connection record from the global connection record list configured by the standard [[EventsModule#worker_connections|worker_connections]] directive in <code>nginx.conf</code>.
zh_cn: 按照当前的实现，每个 "运行中定时器" 将在<code>nginx.conf</code>中用标准[[EventsModule#worker_connectionsworker_connections]]配置的连接记录列表中占据一条（假的）连接记录.

source: According to the current implementation, however, if the client closes the connection before the Lua code finishes reading the request body data via [[#ngx.req.socket|ngx.req.socket]], then ngx_lua will neither stop all the running "light threads" nor call the user callback (if [[#ngx.on_abort|ngx.on_abort]] has been called).
zh_cn: 但是，根据当前的实现，如果客户端在Lua代码使用[[#ngx.req.socketngx.req.socket]]读取请求体数据之前就关闭的连接, ngx_lua模块既不会停止所有运行中的 "轻量线程" 也不会调用用户回调 (如果 [[#ngx.on_abort|ngx.on_abort]] 曾经被调用的话).

source: According to the current implementation, this function can only be called once in a single request handler; subsequent calls will return the error message "duplicate call".
zh_cn: 按当前的实现，此函数只会在一个请求处理器中被调用一次; 再调则返回错误信息 "duplicate call".

source: Acts as a "content handler" and executes Lua code string specified in <code><lua-script-str></code> for every request.
zh_cn: 作为一个 "content handler"，为每个请求执行 <code><lua-script-str></code>中的代码.

source: Acts as a rewrite phase handler and executes Lua code string specified in <code><lua-script-str></code> for every request.
zh_cn: 作为一个 rewrite phase handler，为每个请求执行 <code><lua-script-str></code> 中的代码。

source: Acts as an access phase handler and executes Lua code string specified in <code><lua-script-str></code> for every request.
zh_cn: 作为一个 access phase handler运行，为每个请求执行 <code><lua-script-str></code> 中的代码.

source: After <code>ngx.thread.spawn</code> returns, the newly-created "light thread" will keep running asynchronously usually at various I/O events.
zh_cn: <code>ngx.thread.spawn</code> 返回之后，新创建的 "轻量线程" 将继续异步地执行，通常会响应不同的I/O事件.

source: All of these directives will run in the same order as they appear in the config file.
zh_cn: 所有的命令按照它们在配置文件中出现的次序执行。

source: All the Lua code chunks running by [[#rewrite_by_lua|rewrite_by_lua]], [[#access_by_lua|access_by_lua]], and [[#content_by_lua|content_by_lua]] are in a boilerplate "light thread" created automatically by ngx_lua.
zh_cn: All the Lua code chunks running by [[#rewrite_by_lua|rewrite_by_lua]], [[#access_by_lua|access_by_lua]], and [[#content_by_lua|content_by_lua]] 运行的所有Lua代码块都运行在一个由ngx_lua自动创建的标准"轻量线程"中.

source: All the [[#Nginx API for Lua|Nginx API for Lua]] can be used in the callback function because the function is run in a special "light thread", just as those "light threads" created by [[#ngx.thread.spawn|ngx.thread.spawn]].
zh_cn: 回调函数中可以使用所有的 [[#Nginx API for Lua|Nginx API for Lua]]，这是因为函数运行于一个特殊的"轻量线程"中，与[[#ngx.thread.spawnngx.thread.spawn]]生成的其它"轻量线程"一样.

source: Almost all the Nginx modules can be used with this ngx_lua module by means of [[#ngx.location.capture|ngx.location.capture]] or [[#ngx.location.capture_multi|ngx.location.capture_multi]] but it is recommended to use those <code>lua-resty-*</code> libraries instead of creating subrequests to access the Nginx upstream modules because the former is usually much more flexible and memory-efficient.
zh_cn: 几乎所有的Nginx模块都可以通过 [[#ngx.location.capture|ngx.location.capture]] 或 [[#ngx.location.capture_multi|ngx.location.capture_multi]]来使用ngx_lua模块。但推荐使用 <code>lua-resty-*</code> 库而不是创建子请求来访问Nginx upstream模块，因为前者通常有高得多的灵活性和内存效率。

source: Also note that subrequests just mimic the HTTP interface but there is ''no'' extra HTTP/TCP traffic ''nor'' IPC involved.
zh_cn: 请注意子请求只是模拟了 HTTP 接口，但事实上 ''并没有'' 额外的 HTTP/TCP 流量 ''也没有'' IPC 调用.

source: Also, Lua files which are loaded by <code>dofile</code> or <code>loadfile</code> in *_by_lua_file will never be cached.
zh_cn: 还有，*_by_lua_file中使用 <code>dofile</code> 或 <code>loadfile</code>加载的Lua文件决不会被缓存.

source: Also, by default, an <code>__index</code> metamethod is added to the resulting Lua table and will normalize the keys to a pure lowercase form with all underscores converted to dashes in case of a lookup miss.
zh_cn: 同样, 默认会为结果Lua table添加一个 <code>__index</code> 元方法，它会将所有的key都转换成纯小写形式，并且将所有的下划线转换成减号，以防止查找失败。

source: Also, we introduce some new APIs to provide more functionalities.
zh_cn: 我们还引入了一些新的API来提供更多的功能.

source: Also, when this function is used together with [[#ngx.req.socket|ngx.req.socket]], it is required to call [[#ngx.req.socket|ngx.req.socket]] ''before'' this function, or you will get the "request body already exists" error message.
zh_cn: 还有，如果此函数与 [[#ngx.req.socket|ngx.req.socket]] 一起使用, 必须在调用此函数之前 ''先'' 调用 [[#ngx.req.socket|ngx.req.socket]] , 否则将出现 "request body already exists" 错误.

source: Alternatively, a Lua table can be passed for the <code>args</code> argument for ngx_lua to carry out URI escaping and string concatenation.
zh_cn: 或者可以传一个Lua table给 <code>args</code> 参数，让ngx_lua去完成URI转义和字符串拼接.

source: Alternatively, ngx_lua can be manually compiled into Nginx:
zh_cn: 也可以手动将ngx_lua编译进Nginx:

source: Alternatively, the regex pattern can be presented as a long-bracketed Lua string literal by encasing it in "long brackets", <code>&#91;[...]]</code>, in which case backslashes have to only be escaped once for the Nginx config file parser.
zh_cn: 或者可以将正则表达式写在双方括号里, <code>&#91;[...]]</code>, 这样反斜线只会被Nginx配置文件处理器转义一次.

source: An alternative approach to escaping PCRE sequences is to ensure that Lua code is placed in external script files and executed using the various <code>*_by_lua_file</code> directives.
zh_cn: 另外一种对PCRE序列进行转义的方法是确保Lua代码放在外部脚本文件里，通过各种 <code>*_by_lua_file</code> 命令来调用.

source: An optional Lua table can be specified as the last argument to this method to specify various connect options:
zh_cn: 可以指定一个可选的Lua table作为最后一个参数来提供各种连接选项:

source: An optional option table can be fed as the second argument, which supports the options:
zh_cn: 可以为第2个可选参数提供一个选项table, 支持如下选项:

source: And below is an example demonstrating the "wait any" model:
zh_cn: 下面演示 "wait any" 模式:

source: And it will generate the following output:
zh_cn: 输出:

source: And the <code>ngx.null</code> constant will yield the <code>"null"</code> string output.
zh_cn: <code>ngx.null</code> 常量也写入为 <code>"null"</code> 字符串.

source: And the callback function can also decide to terminate everything by calling [[#ngx.exit|ngx.exit]], for example,
zh_cn: 回调函数也可以决定用 [[#ngx.exit|ngx.exit]] 来停止一切, 例如,

source: And the latter takes priority.
zh_cn: 后者具有更高的优先级.

source: And this is the default value of this directive.
zh_cn: 0也是这个命令的默认值.

source: And when there is such an event, it will call the user Lua function callback (registered by [[#ngx.on_abort|ngx.on_abort]]) or just stop and clean up all the Lua "light threads" running in the current request's request handler when there is no user callback function registered.
zh_cn: 当这种事件发生时，模块将调用用户提供的回调函数 (使用[[#ngx.on_abort|ngx.on_abort]]注册) ，如果用户没有提供回调函数，模块会简单地停止和清除所有在当前请求处理器中的Lua "轻量线程" 。

source: Append new data chunk specified by the <code>data_chunk</code> argument onto the existing request body created by the [[#ngx.req.init_body|ngx.req.init_body]] call.
zh_cn: 将 <code>data_chunk</code> 参数指定的数据块加到用[[#ngx.req.init_bodyngx.req.init_body]]创建的请求体中。

source: Arbitrary data values, including Lua closures and nested tables, can be inserted into this "magic" table.
zh_cn: 任何数据，包括Lua closure和嵌套的table，都可以被放入这个“神奇的”table.

source: Arguments without the <code>=<value></code> parts are treated as boolean arguments.
zh_cn: 没有 <code>=<value></code> 的部分将被视为 boolean 参数.

source: As from the <code>v0.5.0rc29</code> release, Nginx variable interpolation is disabled in the <code><lua-script-str></code> argument of this directive and therefore, the dollar sign character (<code>$</code>) can be used directly.
zh_cn: 从 <code>v0.5.0rc29</code> 起, 本命令中的<code><lua-script-str></code>中禁止使用Nginx 变量 interpolation ，因此,(<code>$</code>)可以直接使用.

source: As from the <code>v0.5.0rc29</code> release, the special notation <code>$prefix</code> or <code>${prefix}</code> can be used in the search path string to indicate the path of the <code>server prefix</code> usually determined by the <code>-p PATH</code> command-line option while starting the Nginx server.
zh_cn: 从<code>v0.5.0rc29</code>版本开始, 特殊标记 <code>$prefix</code> 或 <code>${prefix}</code> 可以在路径字符串中用来表示 <code>server prefix</code> 的路径，它通常可由在Nginx服务器启动时使用 <code>-p PATH</code> 命令行参数来得到。

source: As from the <code>v0.5.0rc32</code> release, all <code>*_by_lua_file</code> configure directives (such as [[#content_by_lua_file|content_by_lua_file]]) support loading Lua 5.1 and LuaJIT 2.0 raw bytecode files directly.
zh_cn: 从 <code>v0.5.0rc32</code> 版本开始, 所有 <code>*_by_lua_file</code> 配置命令(如 [[#content_by_lua_file|content_by_lua_file]]) 支持直接加载Lua 5.1 和 LuaJIT 2.0 原始字节码文件.

source: As from the <code>v0.5.1</code> release, this method also takes an optional <code>options</code> table argument to control the behavior.
zh_cn: 从<code>v0.5.1</code> 版本起, 本方法还接受可选的 <code>options</code> table参数来控制行为.

source: As with other access phase handlers, [[#access_by_lua|access_by_lua]] will ''not'' run in subrequests.
zh_cn: 与其它的 rewrite phase handlers一样, [[#access_by_luaaccess_by_lua]]也''不会''运行在 subrequests 中.

source: At least the following Lua libraries and Nginx modules can be used with this ngx_lua module:
zh_cn: 至少下列Lua库和Nginx模块可以与ngx_lua模块一同使用:

source: At that time ngx_lua can calculate the total length of the body and construct a proper <code>Content-Length</code> header to return to the HTTP 1.0 client.
zh_cn: 这时 ngx_lua 就可以计算出体的总长度从而创建正确的 <code>Content-Length</code> 头返回给 HTTP 1.0 客户端.

source: Attempts to connect a TCP socket object to a remote server or to a stream unix domain socket file without blocking.
zh_cn: 尝试将一个TCP socket对象与远程服务器或流unix domain socket文件进行不阻塞连接。

source: Attempts to connect a UDP socket object to a remote server or to a datagram unix domain socket file.
zh_cn: 尝试将一个 UDP socket 对象连接到一个远程服务器或者数据报的unix domain socket文件.

source: Attempts to load standard Lua 5.1 bytecode files into ngx_lua instances linked to LuaJIT 2.0 or vice versa, will result in an error message, such as that below, being logged into the Nginx <code>error.log</code> file:
zh_cn: 试图在连接了LuaJIT2.0的ngx_lua实例中加载标准Lua5.1的字节码文件，或相反，都将导致以下错误信息被记入nginx <code>error.log</code> 文件:

source: Basically you can safely use Lua libraries that do blocking I/O in this very context because blocking the master process during server start-up is completely okay.
zh_cn: 基本上你可以在这个上下文中安全地使用进行阻塞I/O的Lua库，因为在启动阶段阻塞主进程是完全ok的。

source: Because the Lua code in this context runs before Nginx forks its worker processes (if any), data or code loaded here will enjoy the [http://en.wikipedia.org/wiki/Copy-on-write Copy-on-write (COW)] feature provided by many operating systems among all the worker processes, thus saving a lot of memory.
zh_cn: 由于在这个上下文中的Lua代码是在Nginx fork它的worker进程（如果有的话）之前运行的，所以这里加载和数据或代码会在work进程之间享受很多操作系统都提供的 [http://en.wikipedia.org/wiki/Copy-on-write Copy-on-write (COW)]特性，能够节省大量内存。

source: Because the datagram protocol is actually connection-less, this method does not really establish a "connection", but only just set the name of the remote peer for subsequent read/write operations.
zh_cn: 由于数据报协议事实上是无连接的，本方法并不实际创建 "连接", 只是设置远程对象的名字，以备后续的 读/写 操作使用.

source: Because timer callbacks run in the background and their running time will not add to any client request's response time, they can easily accumulate in the server and exhaust system resources due to either Lua programming mistakes or just too much client traffic.
zh_cn: 由于定时器回调运行在后台，它们的运行时间并不会增加客户端请求的响应时间，所以它们很容易由于Lua程序错误或太多客户端流量而在服务器上积累，耗尽系统资源.
